import streamlit as st 

st.header('Anime:orange[Z] แนะนำ',divider='rainbow')

tab1,tab2,tab3 = st.tabs(['Home','หน้าที่ 1','หน้าที่ 2'])
with tab1:
      st.image('https://wallpapercave.com/wp/wp10938519.jpg')
      st.markdown('สวัสดีครับ ช่วงนี้ก็ใกล้เข้าสู่ช่วงปิดเทอมหน้าร้อนกันแล้วว วันนี้แอดก็มี Anime ที่สนุกมาแนะนำทุกคนไว้ชมในหยุดยาวหน้าร้อนนี้กันครับแต่ละเรื่องบอกเลยว่าสนุกแน่นอน และแอดก็มีลิ้งดูอนิเมะให้ดุและถูกลิขสิทธิ์')

with tab2:

    co1 = st.columns(2)
    with co1[0]:
            st.markdown(' ## Fairy Tail แฟรี่เทล')
            st.image('https://di.lnwfile.com/_/di/_raw/jb/fn/w1.jpg')
    with co1[1]:
            st.markdown('เรื่องย่อ')
            st.markdown('เรื่องราวกล่าวขานถึงโลกในนิยายที่ชื่อว่า "เอิร์ทแลนด์" ดินแดนที่ไม่ว่าใครก็สามารถใช้เวทมนตร์ได้ แต่การจะใช้เวทมนตร์ได้จะต้องสังกัดกิลด์ที่ถูกต้องตามกฎหมายเสียก่อน ลูซี่ ฮาร์ทฟิเลีย เด็กสาวผู้ใฝ่ฝันอยากจะเป็นหนึ่งในสมาชิกของ แฟรี่เทล กิลด์จอมเวทที่ยิ่งใหญ่ที่สุดในขณะนั้น จึงได้เดินทางออกจากคฤหาสน์ฮาร์ทฟิเลียอันเป็นบ้านเกิด เพื่อตามหาความฝันของเธอ และนั่นจึงทำให้เธอได้พบกับ นัตสึ ดรากูนีล จอมเวทผู้ใช้เวทสังหารมังกรที่เดินทางตามหา อิกนีล มังกรที่เลี้ยงเขามาตั้งแต่เด็ก และ แฮปปี้ ประชากรเผ่าเอ็กซ์ซีดที่อพยพหนีมาตั้งแต่ยังไม่เกิดและได้มาอยู่กับนัตสึและทุกคนในแฟรี่เทล นัตสึ รู้สึกถูกชะตากับลูซี่มากจึงได้ชักชวนเธอเข้ากิลด์แฟรี่เทล ที่นั่นทำให้เธอได้พบกับสมาชิกหลักคนอื่น ๆ ของแฟรี่เทล อาทิ เกรย์ ฟูลบัสเตอร์ จอมเวทน้ำแข็ง เอลซ่า สการ์เล็ต จอมเวทที่แข็งแกร่งที่สุดของแฟรี่เทล และเวนดี้ มาร์เวล อีกหนึ่งจอมเวทสังหารมังกร และนั่นจึงทำให้เธอได้พบกับอีกด้านของการผจญภัยที่เธอไม่เคยได้สัมผัสมาก่อน')

    with st.expander('กดเพื่อดูวิดีโอตัวอย่างและรับเพลย์ลิสต์'):
            video_file = open('Trailer/Fa1.mp4', 'rb')
            video_bytes = video_file.read()
            st.video(video_bytes)
            st.caption('ขอบคุณวีดีโอจาก DEXclub')

            st.link_button('กดเพื่อดูอนิเมะ','https://www.youtube.com/playlist?list=PLIa05JMgYhhZGXgk3ktJyYpaNM2TOECfz')

    co = st.columns(2)
    with co[0]:
            st.markdown('## My hero Academia')
            st.image('https://du.lnwfile.com/_webp_fit_images/1024/1024/py/jv/t8.webp',width=400)
    
    with co[1]:
        st.markdown('เรื่องย่อ')
        st.markdown('มิโดริยะ อิซึคุ เป็นเด็กมัธยมต้นธรรมดาคนหนึ่งที่อยู่ในโลกของผู้คนที่ไม่ธรรมดา เพราะว่าโลกที่เขาอยู่นั้น 80% ของมนุษย์ล้วนมี "อัตลักษณ์" หรือว่าพลังเหนือธรรมชาติ ทว่าอิซึกุนั้นได้มีความฝันอยากเป็น "ฮีโร่" หรือวีรบุรุษมาตั้งแต่เด็ก ถึงแม้ตัวเขาเองจะไร้อัตลักษณ์มาตั้งแต่เกิด และทำให้โดนเพื่อนล้อหรือรังแกเพราะเหตุผลดังกล่าวก็ตาม. แต่หลังจากเหตุการวิกฤติวันหนึ่งที่อิซึคุได้พยายามช่วยชีวิตเพื่อนสมัยเด็กของเขาไว้จาก "วิลเลิน" (villian) (ผู้ที่ใช้อัตลักษณ์ในทางที่ไม่ดี) นั้น ทำให้ฮีโร่อันดับ 1 ผู้เป็นไอดอลของอิซึคุนาม ออลไมท์ (All Might) ได้เห็นวีรกรรมของอิซึกุ เขาจึงได้ตัดสินใจมอบอัตลักษณ์ "วัน ฟอร์ ออล" (One for All) ของตนให้อิซึคุเป็นผู้สืบทอด. เรื่องราวหลังจากนี้บอกเล่าประสบการณ์ใน "โรงเรียนมัธยมปลายยูเอ" ของมิโดริยะและอุปสรรคที่เขาต้องฟันฝ่าก่อนที่จะมาเป็นสุดยอดฮีโร่ด้วยความพยายามของเขาเอง')
        
    with st.expander('กดเพื่อดูวิดีโอตัวอย่างและรับเพลย์ลิสต์'):
        video_file = open('Trailer/my.mp4', 'rb')
        video_bytes = video_file.read()
        st.video(video_bytes)
        st.caption('ขอบคุณวีดีโอจาก Japan Anime Movie Thailand')
        st.link_button('กดเพื่อดูอนิเมะ','https://www.youtube.com/watch?v=I3dt2AOtRPs&list=PL_YV8EWtbQXFnSDtJD58JO1CrFR00jeFF')
with tab3:    
    co1 = st.columns(2)
    with co1[0]:
            st.markdown('## FRIEREN คำอธิษฐานในวันที่จากลา')
            st.image('https://www.bloggang.com/data/a/animanlight/picture/1630572505.jpg')
    with co1[1]:
            st.markdown('เรื่องย่อ')
            st.markdown('ฟรีเรน จอมเวทสาวเผ่าเอล์ฟ ผู้เป็น1ใน4คณะผู้กล้าที่ปราบจอมมารลงได้สำเร็จ โดยหลังจากปราบจอมมารแต่ละคนก็แยกย้ายกันไปมีชีวิตของตนเอง แต่ด้วยอายุไขของเอลฟ์ที่แสนยาวนาน ทำให้การเดินทางของเธอยังไม่จบลงเพียงแค่นี้ เมื่อผู้กล้าฮิมเมลจากไปฟรีเรนจึงตัดสินใจออกเดินทางอีกครั้งด้วยความหวังที่จะเข้าใจความรู้สึกของมนุษย์ให้มากขึ้น และตามหาความหมายที่แท้จริงของการมีชีวิต')

    with st.expander('กดเพื่อดูวิดีโอตัวอย่างและรับเพลย์ลิสต์'):
            video_file = open('Trailer/fr.mp4', 'rb')
            video_bytes = video_file.read()
            st.video(video_bytes)
            st.caption('ขอบคุณวีดีโอจาก AnimeSelect')

            st.link_button('กดเพื่อดูอนิเมะ','https://www.youtube.com/watch?v=ar-I3PsxoHg&list=PLIa05JMgYhhZu_NQ0fO__tXCGw5BkWFuK')
    co = st.columns(2)
    with co[0]:
        st.markdown('## Assassination Classroom')
        st.image('https://www.metalbridges.com/wp-content/uploads/2015/02/Assassination-Classroom-0.jpg',width=300)
    
    with co[1]:
        st.markdown('เรื่องย่อ')
        st.markdown('รื่องราวเริ่มต้นจากเหตุการณ์ระเบิดของดวงจันทร์กว่า 70% โดยฝีมือของสิ่งมีชีวิตหน้าตาประหลาดคล้ายปลาหมึกสีเหลือง ซึ่งสามารถเคลื่อนที่ได้เร็ว 20 มัค หรือเท่ากับความเร็วเสียง จึงทำให้ไม่ว่ากองทัพจะจัดยุทโธปกรณ์หนักขนาดไหนก็ไม่มีใครสามารถจัดการได้ ร้ายไปกว่านั้นคือ เป้าหมายต่อไปของมัน ก็คือ การทำลายล้างโลกใบนี้ รัฐบาลจึงตั้งค่าหัวเป็นเงินรางวัล 10,000 ล้านเยน สำหรับใครก็ตามที่กำจัดเจ้านี่ได้')
    with st.expander('กดเพื่อดูวิดีโอตัวอย่างและรับเพลย์ลิสต์'):
        video_file = open('Trailer/As.mp4', 'rb')
        video_bytes = video_file.read()
        st.video(video_bytes)
        st.caption('ขอบคุณวีดีโอจาก Anime TV')
        st.link_button('กดเพื่อดูอนิเมะ','https://www.youtube.com/watch?v=AI0l11AM3e0&list=PLIa05JMgYhhYInRHOLhV_XiTYhe6BCV9F')
              

            
   
