import streamlit as st 

p = 'p/m.png'

page_bg_img = '''<style>
.stApp {
    background-image: url(p);
    background-size: cover;
}
</style>'''
st.markdown(page_bg_img, unsafe_allow_html=True)

st.header('Anime:orange[Z] แนะนำ',divider='rainbow')

# เริ่มต้นโปรแกรมในหน้า 
page_number = st.sidebar.radio("หมวดหมู่", ['AnimeZ',"แอคชั่น",'ดราม่า'])

if page_number =='AnimeZ':
    co = st.columns(2)
    with co[0]:
        st.image('https://scontent.fubp1-1.fna.fbcdn.net/v/t1.6435-9/71348936_103541631050189_5037942251037130752_n.jpg?_nc_cat=100&ccb=1-7&_nc_sid=dd63ad&_nc_eui2=AeHZycmszY2NpOjC_ymFtFh0rxgVcSn4oKOvGBVxKfigo1hkrKm7KRpnnzLdMLQWbIiw7nG0fjSlI92_A-WO2k7Z&_nc_ohc=1M-c89-A4yEAX_n9VZI&_nc_ht=scontent.fubp1-1.fna&oh=00_AfCtsTtkydfHnSME2Xdv9rdkw4NDTfMv_99zOWQrczxhEw&oe=6609599D')
    with co[1]:
        st.markdown(f'อนิเมะ (ญี่ปุ่น: アニメ; โรมาจิ: Anime; ราชบัณฑิตยสภา: อานิเมะ) หมายถึง สื่อเนื้อหาภาพเคลื่อนไหวที่วาดด้วยมือหรือใช้คอมพิวเตอร์กราฟิกจากประเทศญี่ปุ่น คำว่า อนิเมะ เป็นคำภาษาญี่ปุ่น ที่ดัดแปลงมาจากคำภาษาอังกฤษว่า แอนิเมชัน (animation) ซึ่งมาจากภาษาฝรั่งเศส อานีเม่ (animé) แปลว่าเคลื่อนไหว หรือภาพเคลื่อนไหว แต่ได้กลายความหมายจนเป็นคำเฉพาะของภาษาญี่ปุ่น ที่ใช้สื่อถึงสื่อภาพยนตร์การ์ตูน (Animated media) ทุกรูปแบบภายนอกประเทศญี่ปุ่น ')
    st.markdown('อนิเมะหมายถึงภาพยนตร์การ์ตูนสัญชาติญี่ปุ่น หรือภาพยนตร์การ์ตูนที่มีลักษณะของเอกลักษณ์ทางศิลปะเหมือนกับภาพยนตร์การ์ตูนที่ผลิตในญี่ปุ่น[2] อนิเมะส่วนใหญ่จะวาดขึ้นด้วยมือ แต่ปัจจุบันมีการนำคอมพิวเตอร์มาช่วยสร้างอนิเมะอย่างแพร่หลาย ส่วนใหญ่แล้ว อนิเมะเป็นสื่อที่สร้างขึ้นเพื่อให้ความบันเทิงเหมือนภาพยนตร์ โดยมีเนื้อเรื่องที่ดัดแปลงมาจากวรรณกรรมประเภทต่าง ๆ ทั้งที่เป็นนวนิยาย หรือจากสื่อหนังสือการ์ตูนมังงะ ซึ่งทำให้อนิเมะมีเนื้อเรื่องที่หลากหลายและครอบคลุมแนววรรณกรรมเกือบทุกประเภท รวมไปถึงประเภทสื่อลามก อนิเมะมักถูกสร้างขึ้นเป็นตอน ๆ เพื่อฉายทางโทรทัศน์เป็นรายสัปดาห์ ส่วนหนึ่งถูกสร้างเป็นภาพยนตร์การ์ตูนเรื่องยาวเพื่อฉายในโรงภาพยนตร์ และอีกส่วนหนึ่งถูกสร้างเป็นตอน ๆ เพื่อขายตรงในรูปแบบดีวีดี วีซีดี หรือวีดิโอ ซึ่งเป็นการทำตอนเฉพาะที่ไม่ได้ออกอากาศ เรียกว่า โอวีเอ (Original Video Animation) และปัจจุบันก็มีเนื้อหาที่เผยแพร่โดยตรงผ่านอินเทอร์เน็ต เรียกว่า ONA (Original Net Animation) ด้วย นอกจากนี้ยังมีอนิเมะที่ถูกนำไปดัดแปลงเป็นละครโทรทัศน์อีกด้วย ปัจจุบันมีจำนวนอนิเมะที่ถูกสร้างในประเทศญี่ปุ่นราว 500 เรื่องต่อปี')

    st.image('https://www.bloggang.com/data/t/topvalue/picture/1599099551.jpg')
    st.markdown('แน่นอนว่าอนิเมะนั้นมีหลากหลายแนว วันนี้ผมจะมาแนะนำ 2 แนว 4 อนิเมะที่สนุกสุดๆ เป็นอนิเมะในใจผมลยครับ')
elif page_number == "แอคชั่น":
   
    ta1,ta2 = st.tabs(['Fairy Tail','My Hero Academia'])
    # Fairy Tail
    with ta1:
        co1 = st.columns(2)
        with co1[0]:
            st.markdown('Fairy Tail แฟรี่เทล')
            st.image('https://di.lnwfile.com/_/di/_raw/jb/fn/w1.jpg')
        with co1[1]:
            st.markdown('เรื่องย่อ')
            st.markdown('เรื่องราวกล่าวขานถึงโลกในนิยายที่ชื่อว่า "เอิร์ทแลนด์" ดินแดนที่ไม่ว่าใครก็สามารถใช้เวทมนตร์ได้ แต่การจะใช้เวทมนตร์ได้จะต้องสังกัดกิลด์ที่ถูกต้องตามกฎหมายเสียก่อน ลูซี่ ฮาร์ทฟิเลีย เด็กสาวผู้ใฝ่ฝันอยากจะเป็นหนึ่งในสมาชิกของ แฟรี่เทล กิลด์จอมเวทที่ยิ่งใหญ่ที่สุดในขณะนั้น จึงได้เดินทางออกจากคฤหาสน์ฮาร์ทฟิเลียอันเป็นบ้านเกิด เพื่อตามหาความฝันของเธอ และนั่นจึงทำให้เธอได้พบกับ นัตสึ ดรากูนีล จอมเวทผู้ใช้เวทสังหารมังกรที่เดินทางตามหา อิกนีล มังกรที่เลี้ยงเขามาตั้งแต่เด็ก และ แฮปปี้ ประชากรเผ่าเอ็กซ์ซีดที่อพยพหนีมาตั้งแต่ยังไม่เกิดและได้มาอยู่กับนัตสึและทุกคนในแฟรี่เทล นัตสึ รู้สึกถูกชะตากับลูซี่มากจึงได้ชักชวนเธอเข้ากิลด์แฟรี่เทล ที่นั่นทำให้เธอได้พบกับสมาชิกหลักคนอื่น ๆ ของแฟรี่เทล อาทิ เกรย์ ฟูลบัสเตอร์ จอมเวทน้ำแข็ง เอลซ่า สการ์เล็ต จอมเวทที่แข็งแกร่งที่สุดของแฟรี่เทล และเวนดี้ มาร์เวล อีกหนึ่งจอมเวทสังหารมังกร และนั่นจึงทำให้เธอได้พบกับอีกด้านของการผจญภัยที่เธอไม่เคยได้สัมผัสมาก่อน')

        with st.expander('กดเพื่อดูวิดีโอตัวอย่าง'):
            video_file = open('Trailer/Fa1.mp4', 'rb')
            video_bytes = video_file.read()
            st.video(video_bytes)
            st.caption('ขอบคุณวีดีโอจาก DEXclub')

        st.link_button('กดเพื่อดูอนิเมะ','https://www.youtube.com/playlist?list=PLIa05JMgYhhZGXgk3ktJyYpaNM2TOECfz')
    # MY hero  
    with ta2:
        co = st.columns(2)
        with co[0]:
            st.markdown('My hero Academia')
            st.image('https://du.lnwfile.com/_webp_fit_images/1024/1024/py/jv/t8.webp',width=400)
    
        with co[1]:
            st.markdown('เรื่องย่อ')
            st.markdown('มิโดริยะ อิซึคุ เป็นเด็กมัธยมต้นธรรมดาคนหนึ่งที่อยู่ในโลกของผู้คนที่ไม่ธรรมดา เพราะว่าโลกที่เขาอยู่นั้น 80% ของมนุษย์ล้วนมี "อัตลักษณ์" หรือว่าพลังเหนือธรรมชาติ ทว่าอิซึกุนั้นได้มีความฝันอยากเป็น "ฮีโร่" หรือวีรบุรุษมาตั้งแต่เด็ก ถึงแม้ตัวเขาเองจะไร้อัตลักษณ์มาตั้งแต่เกิด และทำให้โดนเพื่อนล้อหรือรังแกเพราะเหตุผลดังกล่าวก็ตาม. แต่หลังจากเหตุการวิกฤติวันหนึ่งที่อิซึคุได้พยายามช่วยชีวิตเพื่อนสมัยเด็กของเขาไว้จาก "วิลเลิน" (villian) (ผู้ที่ใช้อัตลักษณ์ในทางที่ไม่ดี) นั้น ทำให้ฮีโร่อันดับ 1 ผู้เป็นไอดอลของอิซึคุนาม ออลไมท์ (All Might) ได้เห็นวีรกรรมของอิซึกุ เขาจึงได้ตัดสินใจมอบอัตลักษณ์ "วัน ฟอร์ ออล" (One for All) ของตนให้อิซึคุเป็นผู้สืบทอด. เรื่องราวหลังจากนี้บอกเล่าประสบการณ์ใน "โรงเรียนมัธยมปลายยูเอ" ของมิโดริยะและอุปสรรคที่เขาต้องฟันฝ่าก่อนที่จะมาเป็นสุดยอดฮีโร่ด้วยความพยายามของเขาเอง')
        
        with st.expander('กดเพื่อดูวิดีโอตัวอย่าง'):
            video_file = open('Trailer/my.mp4', 'rb')
            video_bytes = video_file.read()
            st.video(video_bytes)
            st.caption('ขอบคุณวีดีโอจาก Japan Anime Movie Thailand')
        st.link_button('กดเพื่อดูอนิเมะ','https://www.youtube.com/watch?v=I3dt2AOtRPs&list=PL_YV8EWtbQXFnSDtJD58JO1CrFR00jeFF')
    
elif page_number == 'ดราม่า':
    ta1,ta2 = st.tabs(['FRIEREN','Assassination Classroom'])
    # Fairy Tail
    with ta1:
        co1 = st.columns(2)
        with co1[0]:
            st.markdown('FRIEREN คำอธิษฐานในวันที่จากลา')
            st.image('https://www.bloggang.com/data/a/animanlight/picture/1630572505.jpg')
        with co1[1]:
            st.markdown('เรื่องย่อ')
            st.markdown('ฟรีเรน จอมเวทสาวเผ่าเอล์ฟ ผู้เป็น1ใน4คณะผู้กล้าที่ปราบจอมมารลงได้สำเร็จ โดยหลังจากปราบจอมมารแต่ละคนก็แยกย้ายกันไปมีชีวิตของตนเอง แต่ด้วยอายุไขของเอลฟ์ที่แสนยาวนาน ทำให้การเดินทางของเธอยังไม่จบลงเพียงแค่นี้ เมื่อผู้กล้าฮิมเมลจากไปฟรีเรนจึงตัดสินใจออกเดินทางอีกครั้งด้วยความหวังที่จะเข้าใจความรู้สึกของมนุษย์ให้มากขึ้น และตามหาความหมายที่แท้จริงของการมีชีวิต')

        with st.expander('กดเพื่อดูวิดีโอตัวอย่าง'):
            video_file = open('Trailer/fr.mp4', 'rb')
            video_bytes = video_file.read()
            st.video(video_bytes)
            st.caption('ขอบคุณวีดีโอจาก AnimeSelect')

        st.link_button('กดเพื่อดูอนิเมะ','https://www.youtube.com/watch?v=ar-I3PsxoHg&list=PLIa05JMgYhhZu_NQ0fO__tXCGw5BkWFuK')
    # MY hero  
    with ta2:
        co = st.columns(2)
        with co[0]:
            st.markdown('Assassination Classroom')
            st.image('https://www.metalbridges.com/wp-content/uploads/2015/02/Assassination-Classroom-0.jpg',width=300)
    
        with co[1]:
            st.markdown('เรื่องย่อ')
            st.markdown('รื่องราวเริ่มต้นจากเหตุการณ์ระเบิดของดวงจันทร์กว่า 70% โดยฝีมือของสิ่งมีชีวิตหน้าตาประหลาดคล้ายปลาหมึกสีเหลือง ซึ่งสามารถเคลื่อนที่ได้เร็ว 20 มัค หรือเท่ากับความเร็วเสียง จึงทำให้ไม่ว่ากองทัพจะจัดยุทโธปกรณ์หนักขนาดไหนก็ไม่มีใครสามารถจัดการได้ ร้ายไปกว่านั้นคือ เป้าหมายต่อไปของมัน ก็คือ การทำลายล้างโลกใบนี้ รัฐบาลจึงตั้งค่าหัวเป็นเงินรางวัล 10,000 ล้านเยน สำหรับใครก็ตามที่กำจัดเจ้านี่ได้')
        with st.expander('กดเพื่อดูวิดีโอตัวอย่าง'):
            video_file = open('Trailer/As.mp4', 'rb')
            video_bytes = video_file.read()
            st.video(video_bytes)
            st.caption('ขอบคุณวีดีโอจาก Anime TV')
        st.link_button('กดเพื่อดูอนิเมะ','https://www.youtube.com/watch?v=AI0l11AM3e0&list=PLIa05JMgYhhYInRHOLhV_XiTYhe6BCV9F')
    
              

            
   